{
"courses":[
    {
        "School": "CISC",
        "ClassID": 101,
        "CourseName": "Principles of Computing",
        "Desc": "Introduces students to the central ideas of computing and computer science including programs, algorithms, abstraction, the internet, and information systems. Instills ideas and practices of computational thinking and engages students in activities that show how computing and computer science change the world. Explores computing as a creative activity and empowers students to apply computational thinking to all disciplines including the arts, humanities, business, social and physical sciences, health, and entertainment.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 103,
        "CourseName": "Introduction to Computer Science with Web Applications",
        "Desc": "Principles of computer science illustrated through programming in scripting languages such as JavaScript and VBScript. Topics include control structures, arrays, functions, and procedures. Programming projects illustrate web-based applications.",
        "PreReq": "Open to non-majors",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 106,
        "CourseName": "General Computer Science for Engineers",
        "Desc": "Principles of computer science illustrated and applied through programming in a general-purpose language. Programming projects illustrate computational problems, styles, and issues that arise in engineering.",
        "PreReq": "N/A",
        "CoReq": "MATH 241 or any higher level MATH course.",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 108,
        "CourseName": "Introduction to Computer Science I",
        "Desc": "Computing and principles of programming with an emphasis on systematic program design. Topics include functional programming, data abstraction, procedural abstraction, use of control and state, recursion, testing, and object-oriented programming concepts. Requires no prior programming experience, open to any major, but intended primarily for majors and minors in computer science or mathematics.",
        "PreReq": "N/A",
        "CoReq": "MATH 115, MATH 117, or higher math course or math placement.",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 181,
        "CourseName": "Introduction to Computer Science II",
        "Desc": "Principles of computer science illustrated and applied through programming in an object oriented language. Programming projects illustrate computational problems, styles and issues that arise in computer systems development and in all application areas of computation.",
        "PreReq": "Grade of C- or better in CISC 108 or CISC 106",
        "CoReq": "MATH 221, MATH 241, or a higher level math course or math placement.",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 187,
        "CourseName": "Vertically Integrated Projects I",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise. ",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 1
    },
    {
        "School": "CISC",
        "ClassID": 210,
        "CourseName": "Introduction to Systems Programming",
        "Desc": "Principles of computer systems programming for software and hardware platforms to achieve efficient resource usage. Topics include the C programming language, memory management, and awareness of system constraints and interfacing. Projects include programming embedded systems and interactive objects.",
        "PreReq": "A grade of C- or better in CISC 106 or CISC 108",
        "CoReq": "MATH 221 or MATH 241 or a higher level math course or math placement.",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 220,
        "CourseName": "Data Structures",
        "Desc": "Review of data type abstraction, recursion, arrays, stacks, queues, multiple stacks and linked lists. Emphasis on dynamic storage management, garbage collection, trees, graphs, tables, sorting and searching.",
        "PreReq": "A minimum grade of C- in CISC 210",
        "CoReq": " MATH 210 or MATH 241",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 250,
        "CourseName": "Business Telecommunication Networks",
        "Desc": "Examines technologies of information transmission currently utilized in the business environments and the implications of these technologies upon the development and implementation of information systems. Provides a basic background in the convergence of voice, data and video services into common digital networks. Security issues also considered.",
        "PreReq": "CISC 181 or MISY 160",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 260,
        "CourseName": "Machine Organization and Assembly Language",
        "Desc": "Introduction to the basics of machine organization. Programming tools and techniques at the machine and assembly levels. Assembly language programming and computer arithmetic techniques.",
        "PreReq": "A minimum grade of C- in CISC 210",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 275,
        "CourseName": "Introduction to Software Engineering",
        "Desc": "Object oriented software design and development through use of an object oriented programming language. Topics include team programming, design patterns, graphical user interfaces, software engineering tools (e.g., integrated development environments, version control, build management, bug tracking, automated testing).",
        "PreReq": "Minimum grade of C- in CISC 181 and CISC 220",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 287,
        "CourseName": "Vertically Integrated Projects II",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise. ",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 1
    },
    {
        "School": "CISC",
        "ClassID": 287,
        "CourseName": "Vertically Integrated Projects II",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise. ",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 2
    },
    {
        "School": "CISC",
        "ClassID": 303,
        "CourseName": "Automata Theory",
        "Desc": "Automata and formal language theory. Background for advanced applications in compilers, computer networks, operating systems, and natural language processing. Finite automata and regular languages. Push down automata and context free grammars. Turing machines.",
        "PreReq": "A minimum grade of C- in both MATH 210 and CISC 220",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 304,
        "CourseName": "Logic for Programming",
        "Desc": "Propositional and predicate logic for general reasoning and advanced applications in knowledge representation in artificial intelligence and database, program correctness and programming semantics. Models, resolution, logic programming, and natural deduction.",
        "PreReq": "CISC 220, MATH 210 (with minimum C- grade in both).",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 320,
        "CourseName": "Introduction to Algorithms",
        "Desc": "Design and analysis of algorithms: worst/average case analysis, proofs for correctness and performance of algorithms. Algorithmic strategies (divide and conquer, greedy methods, dynamic programming, etc.). Algorithms for searching, forming and traversal of strings, trees and graphs. Categorization of computational problems: classes P and NP. NP completeness.",
        "PreReq": " MATH 210 and a minimum grade of C- in CISC 220",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 355,
        "CourseName": "Computers, Ethics and Society",
        "Desc": "Explains relationships among information technology, society and ethics by examining issues raised by increasingly widespread use of computers. Topics include ethics for computer professionals, computer impact on factory work, office work, personal privacy and social power distribution.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 356,
        "CourseName": "Intellectual Property in the Digital Age",
        "Desc": "Explore economic, philosophical, social, and technical approaches to intellectual property (1500 BCE to present) then will research contemporary IP issues in software, entertainment, the Internet, and biotechnology.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 357,
        "CourseName": "Engaging Youth in Computing",
        "Desc": "Develop communication, leadership, and teaching skills while working with youth to broaden participation in computing. With training, student teams assist in after-school programs and K-12 classes to engage youth in computational thinking. Focus on low-entry technologies for creating interactive stories, games, websites, and robotics projects.",
        "PreReq": "CISC 101 or CISC 103 or CISC 106 or CISC 108",
        "CoReq": "N/A",
        "Credits": 1
    },
    {
        "School": "CISC",
        "ClassID": 357,
        "CourseName": "Engaging Youth in Computing",
        "Desc": "Develop communication, leadership, and teaching skills while working with youth to broaden participation in computing. With training, student teams assist in after-school programs and K-12 classes to engage youth in computational thinking. Focus on low-entry technologies for creating interactive stories, games, websites, and robotics projects.",
        "PreReq": "CISC 101 or CISC 103 or CISC 106 or CISC 108",
        "CoReq": "N/A",
        "Credits": 2
    },
    {
        "School": "CISC",
        "ClassID": 357,
        "CourseName": "Engaging Youth in Computing",
        "Desc": "Develop communication, leadership, and teaching skills while working with youth to broaden participation in computing. With training, student teams assist in after-school programs and K-12 classes to engage youth in computational thinking. Focus on low-entry technologies for creating interactive stories, games, websites, and robotics projects.",
        "PreReq": "CISC 101 or CISC 103 or CISC 106 or CISC 108",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 360,
        "CourseName": "Computer Architecture",
        "Desc": "Principles and techniques used in the architecture of digital computers. Machine elements and their interrelation. Instruction sets, risc vs cisc, registers, busses and switches.",
        "PreReq": "A minimum grade of C- in CISC 220 and CISC 260 (or equivalent courses).",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 361,
        "CourseName": "Operating Systems",
        "Desc": "Principles and techniques employed in the development of operating systems and their control programs. Includes management of memory, processors, I/O devices.",
        "PreReq": "A minimum grade of C- in both CISC 220 and CISC 260. CPEG 222 may be substituted for CISC 260",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 372,
        "CourseName": "Parallel Computing",
        "Desc": "Introduction to parallel computing concepts, methodologies, and tools. Programming and algorithmic techniques for code that will run simultaneously on parallel computing architectures. Topics include: single and multi-core parallelism, shared and distributed memory architectures, concurrency, program decomposition, data distribution, communication, load balancing, scalability, locality, granularity, debugging, performance evaluation.",
        "PreReq": "C- or better in both CISC 220 and CISC 260",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 374,
        "CourseName": "Educational Game Development",
        "Desc": "Experience the software engineering process through creating educational games for youth; open-ended, project-oriented team learning while assisting regional teachers in integrating computing and computational thinking into the classroom; interact with teachers as clients, hone communication skills and experience design-studio-based critiques of your ideas.",
        "PreReq": "CISC 220.",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 387,
        "CourseName": "Vertically Integrated Projects III",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 1
    },
    {
        "School": "CISC",
        "ClassID": 387,
        "CourseName": "Vertically Integrated Projects III",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 2
    },
    {
        "School": "CISC",
        "ClassID": 387,
        "CourseName": "Vertically Integrated Projects III",
        "Desc": "The Vertically-Integrated Projects (VIP) Program operates in a research and development context. Undergraduate students that join VIP teams earn academic credit for their participation in design/discovery efforts that assist faculty and graduate students with research and development issues in their areas of expertise.",
        "PreReq": "N/A",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 401,
        "CourseName": "Elements of the Theory of Computation",
        "Desc": "General models of computation, formal languages and automata theory and algorithmic unsolvability.",
        "PreReq": "CISC 303",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 404,
        "CourseName": "Logic in Computer Science",
        "Desc": "Formal introduction to first-order logic with emphasis on its relevance to computer science. Syntax, semantics, models, formal proofs and results on soundness, consistency, completeness, compactness and undecidability. Automated theorem proving also covered.",
        "PreReq": "CISC 304",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 410,
        "CourseName": "Computational Mathematics I",
        "Desc": "Floating point numbers; conditioning and stability; LU, Cholesky, and QR factorizations; square and overdetermined linear systems; Newton and quasi- Newton rootfinding methods; piecewise polynomials for interpolation, integration, and finite differences; explicit methods for initial-value problems.",
        "PreReq": "MATH 305 or MATH 351 or MATH 349",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "CISC",
        "ClassID": 411,
        "CourseName": "Computational Mathematics II",
        "Desc": "Eigenvalue and singular-value decompositions; power and Krylov subspace iterations; global interpolation and quadrature; methods for boundary-value problems and Poisson’s equation; implicit solvers for stiff problems; method of lines for partial differential equations; diffusion and advection problems.",
        "PreReq": "MATH 426or CISC 410 or MATH 353",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 10,
        "CourseName": "Intermediate Algebra",
        "Desc": "This course prepares students with the skills necessary for pre-calculus and college mathematics and statistics. Topics include solving equations (linear, rational, and quadratic) and inequalities, linear functions, systems of equations, and operations with polynomial, rational, and radical expressions.",
        "PreReq": "Students must achieve an acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences.",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 113,
        "CourseName": "Contemporary Mathematics",
        "Desc": "Collection of topics that explore the application of mathematics in a variety of complex natural and business environments. Required topics include surveys, data collection and analysis, and basic probability. Four (or more) additional topics would be chosen from the following list: management science (Euler and Hamilton circuits, networks, digraphs, scheduling, etc.), social choice, finance, growth or decay, coding information, shape and form in nature and art, similar figures, logic, set theory, numeration systems, and measurement.",
        "PreReq": "Level G required on the Math Placement Exam.",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 114,
        "CourseName": "College Mathematics and Statistics",
        "Desc": "Stresses mathematical concepts and algebraic skills with a strong emphasis on applications in the areas of management, life and social sciences. Topics include various function classes and models as well as statistics including descriptive statistics, probability, and regression.",
        "PreReq": "Requires a grade of C- or better in MATH 010 or students must achieve an acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences.",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 115,
        "CourseName": "Pre-Calculus",
        "Desc": "The various classes of functions and their graphs are explored. Functionclasses include linear, quadratic, polynomial, rational, exponential,logarithmic and trigonometric. Skills and concepts needed for calculus (MATH221) are emphasized.",
        "PreReq": "Requires a grade of C- or better in MATH 010 or students must achieve an acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences.",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 117,
        "CourseName": "Pre-Calculus for Scientists and Engineers",
        "Desc": "Designed to prepare students for MATH241. All topics included in MATH115 arecovered, as well as additional topics in functions, trigonometry, linearsystems, and nonlinear systems. Other topics may be added at the discretion of the instructor.",
        "PreReq": "Requires a grade of C- or better in MATH 010 or students must achieve an acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences",
        "CoReq": "N/A",
        "Credits": 4
    },
    {
        "School": "MATH",
        "ClassID": 127,
        "CourseName": "Mathematics and Quantitative Reasoning",
        "Desc": "Mathematics driven by typical quantitative reasoning needed in everyday life. Combines critical thinking with basic mathematics in contexts encountered in various areas such as finance, social sciences, politics, the environment, etc. Includes probability and statistics, basic logic, and basic finance.",
        "PreReq": "High school algebra",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 201,
        "CourseName": "Introduction to Statistical Methods I",
        "Desc": "Exploratory data analysis, basic probability, discrete and continuous distributions, sampling distributions and confidence intervals, and one- and two-sample hypothesis tests on means and proportions. Emphasis on applications in business and economics. Statistical computing is an integral part of this course.",
        "PreReq": "College algebra",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 202,
        "CourseName": "Introduction to Statistical Methods II",
        "Desc": "Two-sample tests on means and proportions, chi-square analysis of contingency tables, completely randomized and randomized block designs, factorial experiments, analysis of variance, simple linear and multiple regression, model diagnostics, quality control, time series analysis. Emphasis on applications in business and economics. Statistical computing is an integral part of this course.",
        "PreReq": "MATH 201",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 205,
        "CourseName": "Statistical Methods",
        "Desc": "Descriptive statistics, graphical displays, sampling, variation, normal distribution, estimation, hypothesis testing, one-way analysis of variance, simple linear regression and goodness of fit. Laboratory covers use of statistical packages on mainframe and microcomputers.",
        "PreReq": "MATH 210 or MATH 230",
        "CoReq": "N/A",
        "Credits": 4
    },
    {
        "School": "MATH",
        "ClassID": 208,
        "CourseName": "Integrated Mathematics, Science and Computer Learning",
        "Desc": "Integrate the learning of mathematics, science and computers. Use interactive computer programs and write computer programs for modeling and problem solving.",
        "PreReq": "N/A",
        "CoReq": "MATH 117 or MATH 241 or MATH 242",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 210,
        "CourseName": "Discrete Mathematics I",
        "Desc": "Elements of sets and logic. Relations, functions. Integers. Induction and recursion. Principles and techniques of counting. Graphs. Paths and circuits",
        "PreReq": "N/A",
        "CoReq": "MATH 241, MATH 242, or MATH 232",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 221,
        "CourseName": "Calculus I",
        "Desc": "Topics include functions, graphing functions, limits, derivatives, exponential and logarithmic functions, integration, and techniques of integration. Business applications are emphasized.",
        "PreReq": "MATH 115, or MATH 117 or an acceptable score (determined by the Department of Mathematical Sciences) on the Math Placement Exam. ",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 222,
        "CourseName": "Calculus II",
        "Desc": "Topics include integration, Taylor polynomials, series, multivariable calculus and trigonometric functions.",
        "PreReq": "MATH 221 or MATH 241",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 230,
        "CourseName": "Finite Mathematics with Applications",
        "Desc": "Set theory, probability, optimization, linear programming and an introduction to matrix methods.",
        "PreReq": "MATH 221",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 231,
        "CourseName": "Integrated Calculus IA",
        "Desc": "Calculus topics of limits, continuity, derivatives, and applications of derivatives are developed in the context of polynomial, rational, exponential, and logarithmic function classes. First semester of a two-semester course, partial coverage of MATH 241 topics.",
        "PreReq": "Requires a grade of C- or better in MATH 010 or students must achieve an acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences.",
        "CoReq": "N/A",
        "Credits": 4
    },
    {
        "School": "MATH",
        "ClassID": 232,
        "CourseName": "Integrated Calculus IB",
        "Desc": "Calculus topics of integration in the context of polynomial, rational, exponential, and logarithmic function classes. Trigonometric functions introduced and followed with limits, derivatives, integrals, and applications in the context of trigonometric functions. Differential equations modeling exponential growth and decay (linear and separable ODEs). Second semester of a two-semester course.  ",
        "PreReq": " Successful completion (D- or better) in MATH 231",
        "CoReq": "N/A",
        "Credits": 3
    },
    {
        "School": "MATH",
        "ClassID": 241,
        "CourseName": "Analytic Geometry and Calculus A",
        "Desc": "Functions, limits, continuity, derivatives. Polynomial, rational, exponential, hyperbolic, logarithmic, trigonometric and inverse trigonometric functions. Definite and indefinite integrals and the Fundamental Theorem of Calculus. Simple differential equations (separable ODE, linear ODE). ODE models leading to exponential growth and decay.",
        "PreReq": "MATH 117 or acceptable score on the Math Placement Exam in accordance with current standards determined by the Department of Mathematical Sciences.",
        "CoReq": "N/A",
        "Credits": 4
    },
    {
        "School": "MATH",
        "ClassID": 242,
        "CourseName": "Analytic Geometry and Calculus B",
        "Desc": "Brief review of MATH 241; evaluation of limits by L’Hospital’s rule; applications of integration; integration techniques; parametric curves; polar coordinates; infinite sequences and series. Includes use of computers to perform symbolic, numerical and graphical analysis.",
        "PreReq": " MATH 241 or MATH 232",
        "CoReq": "N/A",
        "Credits": 4
    },
    {
        "School": "MATH",
        "ClassID": 243,
        "CourseName": "Analytic Geometry and Calculus C",
        "Desc": "Vectors, operations on vectors, velocity and acceleration, partial derivatives, directional derivatives, optimization of functions of two or more variables, integration over two and three dimensional regions, line integrals, Green’s Theorem, surface integrals, the Divergence theorem. Includes use of computers to perform symbolic, numerical and graphical analysis.",
        "PreReq": "MATH 242",
        "CoReq": "N/A",
        "Credits": 4
    }
]
}